yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8af6223a.h
/* LINUART guard time register */
__IO_REG8    (LINUART_GTR, 0x523A, __READ_WRITE);
/* LINUART prescaler register */
__IO_REG8    (LINUART_PSCR, 0x523B, __READ_WRITE);

/*-------------------------------------------------------------------------
 *      LINUART bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define LINUART_SR_PE            LINUART_SR_bit.PE
#define LINUART_SR_FE            LINUART_SR_bit.FE
#define LINUART_SR_NF            LINUART_SR_bit.NF
#define LINUART_SR_OR            LINUART_SR_bit.OR
#define LINUART_SR_IDLE          LINUART_SR_bit.IDLE
#define LINUART_SR_RXNE          LINUART_SR_bit.RXNE
#define LINUART_SR_TC            LINUART_SR_bit.TC
#define LINUART_SR_TXE           LINUART_SR_bit.TXE

#define LINUART_CR1_PIEN         LINUART_CR1_bit.PIEN
#define LINUART_CR1_PS           LINUART_CR1_bit.PS
#define LINUART_CR1_PCEN         LINUART_CR1_bit.PCEN
#define LINUART_CR1_WAKE         LINUART_CR1_bit.WAKE
#define LINUART_CR1_M            LINUART_CR1_bit.M
#define LINUART_CR1_UARTD        LINUART_CR1_bit.UARTD
#define LINUART_CR1_T8           LINUART_CR1_bit.T8
#define LINUART_CR1_R8           LINUART_CR1_bit.R8

#define LINUART_CR2_SBK          LINUART_CR2_bit.SBK
#define LINUART_CR2_RWU          LINUART_CR2_bit.RWU
#define LINUART_CR2_REN          LINUART_CR2_bit.REN
#define LINUART_CR2_TEN          LINUART_CR2_bit.TEN
#define LINUART_CR2_ILIEN        LINUART_CR2_bit.ILIEN
#define LINUART_CR2_RIEN         LINUART_CR2_bit.RIEN
#define LINUART_CR2_TCIEN        LINUART_CR2_bit.TCIEN
#define LINUART_CR2_TIEN         LINUART_CR2_bit.TIEN

#define LINUART_CR3_LBCL         LINUART_CR3_bit.LBCL
#define LINUART_CR3_CPHA         LINUART_CR3_bit.CPHA
#define LINUART_CR3_CPOL         LINUART_CR3_bit.CPOL
#define LINUART_CR3_CKEN         LINUART_CR3_bit.CKEN
#define LINUART_CR3_STOP         LINUART_CR3_bit.STOP
#define LINUART_CR3_LINEN        LINUART_CR3_bit.LINEN

#define LINUART_CR4_ADD          LINUART_CR4_bit.ADD
#define LINUART_CR4_LBDF         LINUART_CR4_bit.LBDF
#define LINUART_CR4_LBDL         LINUART_CR4_bit.LBDL
#define LINUART_CR4_LBDIEN       LINUART_CR4_bit.LBDIEN

#define LINUART_CR6_LSF          LINUART_CR6_bit.LSF
#define LINUART_CR6_LHDF         LINUART_CR6_bit.LHDF
#define LINUART_CR6_LHDIEN       LINUART_CR6_bit.LHDIEN
#define LINUART_CR6_LASE         LINUART_CR6_bit.LASE
#define LINUART_CR6_LSLV         LINUART_CR6_bit.LSLV
#define LINUART_CR6_LDUM         LINUART_CR6_bit.LDUM

#endif

/*-------------------------------------------------------------------------
 *      LINUART bit masks
 *-----------------------------------------------------------------------*/
#define MASK_LINUART_SR_PE       0x01
#define MASK_LINUART_SR_FE       0x02
#define MASK_LINUART_SR_NF       0x04
#define MASK_LINUART_SR_OR       0x08
#define MASK_LINUART_SR_IDLE     0x10
#define MASK_LINUART_SR_RXNE     0x20
#define MASK_LINUART_SR_TC       0x40
#define MASK_LINUART_SR_TXE      0x80

#define MASK_LINUART_CR1_PIEN    0x01
#define MASK_LINUART_CR1_PS      0x02
#define MASK_LINUART_CR1_PCEN    0x04
#define MASK_LINUART_CR1_WAKE    0x08
#define MASK_LINUART_CR1_M       0x10
#define MASK_LINUART_CR1_UARTD   0x20
#define MASK_LINUART_CR1_T8      0x40
#define MASK_LINUART_CR1_R8      0x80

#define MASK_LINUART_CR2_SBK     0x01
#define MASK_LINUART_CR2_RWU     0x02
#define MASK_LINUART_CR2_REN     0x04
#define MASK_LINUART_CR2_TEN     0x08
#define MASK_LINUART_CR2_ILIEN   0x10
#define MASK_LINUART_CR2_RIEN    0x20
#define MASK_LINUART_CR2_TCIEN   0x40
#define MASK_LINUART_CR2_TIEN    0x80

#define MASK_LINUART_CR3_LBCL    0x01
#define MASK_LINUART_CR3_CPHA    0x02
#define MASK_LINUART_CR3_CPOL    0x04
#define MASK_LINUART_CR3_CKEN    0x08
#define MASK_LINUART_CR3_STOP    0x30
#define MASK_LINUART_CR3_LINEN   0x80

#define MASK_LINUART_CR4_ADD     0x0F
#define MASK_LINUART_CR4_LBDF    0x10
#define MASK_LINUART_CR4_LBDL    0x20
#define MASK_LINUART_CR4_LBDIEN  0x40

#define MASK_LINUART_CR6_LSF     0x01
#define MASK_LINUART_CR6_LHDF    0x02
#define MASK_LINUART_CR6_LHDIEN  0x04
#define MASK_LINUART_CR6_LASE    0x10
#define MASK_LINUART_CR6_LSLV    0x20
#define MASK_LINUART_CR6_LDUM    0x80


/*-------------------------------------------------------------------------
 *      TIM1 register definitions
 *-----------------------------------------------------------------------*/
/* TIM1 control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CEN         : 1;
  unsigned char UDIS        : 1;
  unsigned char URS         : 1;
  unsigned char OPM         : 1;
  unsigned char DIR         : 1;
  unsigned char CMS         : 2;
  unsigned char ARPE        : 1;
} __BITS_TIM1_CR1;
#endif
__IO_REG8_BIT(TIM1_CR1,    0x5250, __READ_WRITE, __BITS_TIM1_CR1);

/* TIM1 control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCPC        : 1;
  unsigned char             : 1;
  unsigned char COMS        : 1;
  unsigned char             : 1;
  unsigned char MMS         : 3;
} __BITS_TIM1_CR2;
#endif
__IO_REG8_BIT(TIM1_CR2,    0x5251, __READ_WRITE, __BITS_TIM1_CR2);

/* TIM1 slave mode control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SMS         : 3;
  unsigned char             : 1;
  unsigned char TS          : 3;
  unsigned char MSM         : 1;
} __BITS_TIM1_SMCR;
#endif
__IO_REG8_BIT(TIM1_SMCR,   0x5252, __READ_WRITE, __BITS_TIM1_SMCR);

/* TIM1 external trigger register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ETF         : 4;
  unsigned char ETPS        : 2;
  unsigned char ECE         : 1;
  unsigned char ETP         : 1;
} __BITS_TIM1_ETR;
#endif
__IO_REG8_BIT(TIM1_ETR,    0x5253, __READ_WRITE, __BITS_TIM1_ETR);

/* TIM1 Interrupt enable register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIE         : 1;
  unsigned char CC1IE       : 1;
  unsigned char CC2IE       : 1;
  unsigned char CC3IE       : 1;
  unsigned char CC4IE       : 1;
  unsigned char COMIE       : 1;
  unsigned char TIE         : 1;
  unsigned char BIE         : 1;
} __BITS_TIM1_IER;
#endif
__IO_REG8_BIT(TIM1_IER,    0x5254, __READ_WRITE, __BITS_TIM1_IER);

/* TIM1 status register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIF         : 1;
  unsigned char CC1IF       : 1;
  unsigned char CC2IF       : 1;
  unsigned char CC3IF       : 1;
  unsigned char CC4IF       : 1;
  unsigned char COMIF       : 1;
  unsigned char TIF         : 1;
  unsigned char BIF         : 1;
} __BITS_TIM1_SR1;
#endif
__IO_REG8_BIT(TIM1_SR1,    0x5255, __READ_WRITE, __BITS_TIM1_SR1);

