yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8af6223a.h
#define MASK_TIM1_CCMR4_CC4S     0x03
#define MASK_TIM1_CCMR4_OC4FE    0x04
#define MASK_TIM1_CCMR4_OC4PE    0x08
#define MASK_TIM1_CCMR4_OC4M     0x70
#define MASK_TIM1_CCMR4_OC4CE    0x80

#define MASK_TIM1_CCER1_CC1E     0x01
#define MASK_TIM1_CCER1_CC1P     0x02
#define MASK_TIM1_CCER1_CC1NE    0x04
#define MASK_TIM1_CCER1_CC1NP    0x08
#define MASK_TIM1_CCER1_CC2E     0x10
#define MASK_TIM1_CCER1_CC2P     0x20
#define MASK_TIM1_CCER1_CC2NE    0x40
#define MASK_TIM1_CCER1_CC2NP    0x80

#define MASK_TIM1_CCER2_CC3E     0x01
#define MASK_TIM1_CCER2_CC3P     0x02
#define MASK_TIM1_CCER2_CC3NE    0x04
#define MASK_TIM1_CCER2_CC3NP    0x08
#define MASK_TIM1_CCER2_CC4E     0x10
#define MASK_TIM1_CCER2_CC4P     0x20

#define MASK_TIM1_BKR_LOCK       0x03
#define MASK_TIM1_BKR_OSSI       0x04
#define MASK_TIM1_BKR_OSSR       0x08
#define MASK_TIM1_BKR_BKE        0x10
#define MASK_TIM1_BKR_BKP        0x20
#define MASK_TIM1_BKR_AOE        0x40
#define MASK_TIM1_BKR_MOE        0x80

#define MASK_TIM1_OISR_OIS1      0x01
#define MASK_TIM1_OISR_OIS1N     0x02
#define MASK_TIM1_OISR_OIS2      0x04
#define MASK_TIM1_OISR_OIS2N     0x08
#define MASK_TIM1_OISR_OIS3      0x10
#define MASK_TIM1_OISR_OIS3N     0x20
#define MASK_TIM1_OISR_OIS4      0x40


/*-------------------------------------------------------------------------
 *      TIM5 register definitions
 *-----------------------------------------------------------------------*/
/* TIM5 control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CEN         : 1;
  unsigned char UDIS        : 1;
  unsigned char URS         : 1;
  unsigned char OPM         : 1;
  unsigned char             : 3;
  unsigned char ARPE        : 1;
} __BITS_TIM5_CR1;
#endif
__IO_REG8_BIT(TIM5_CR1,    0x5300, __READ_WRITE, __BITS_TIM5_CR1);

/* TIM5 control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCPC        : 1;
  unsigned char             : 1;
  unsigned char COMS        : 1;
  unsigned char             : 1;
  unsigned char MMS         : 3;
} __BITS_TIM5_CR2;
#endif
__IO_REG8_BIT(TIM5_CR2,    0x5301, __READ_WRITE, __BITS_TIM5_CR2);

/* TIM5 slave mode control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SMS         : 3;
  unsigned char             : 1;
  unsigned char TS          : 3;
  unsigned char MSM         : 1;
} __BITS_TIM5_SMCR;
#endif
__IO_REG8_BIT(TIM5_SMCR,   0x5302, __READ_WRITE, __BITS_TIM5_SMCR);

/* TIM5 interrupt enable register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIE         : 1;
  unsigned char CC1IE       : 1;
  unsigned char CC2IE       : 1;
  unsigned char CC3IE       : 1;
  unsigned char             : 2;
  unsigned char TIE         : 1;
} __BITS_TIM5_IER;
#endif
__IO_REG8_BIT(TIM5_IER,    0x5303, __READ_WRITE, __BITS_TIM5_IER);

/* TIM5 status register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIF         : 1;
  unsigned char CC1IF       : 1;
  unsigned char CC2IF       : 1;
  unsigned char CC3IF       : 1;
  unsigned char             : 2;
  unsigned char TIF         : 1;
} __BITS_TIM5_SR1;
#endif
__IO_REG8_BIT(TIM5_SR1,    0x5304, __READ_WRITE, __BITS_TIM5_SR1);

/* TIM5 status register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 1;
  unsigned char CC1OF       : 1;
  unsigned char CC2OF       : 1;
  unsigned char CC3OF       : 1;
} __BITS_TIM5_SR2;
#endif
__IO_REG8_BIT(TIM5_SR2,    0x5305, __READ_WRITE, __BITS_TIM5_SR2);

/* TIM5 event generation register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UG          : 1;
  unsigned char CC1G        : 1;
  unsigned char CC2G        : 1;
  unsigned char CC3G        : 1;
  unsigned char             : 2;
  unsigned char TG          : 1;
} __BITS_TIM5_EGR;
#endif
__IO_REG8_BIT(TIM5_EGR,    0x5306, __WRITE, __BITS_TIM5_EGR);

/* TIM5 capture/compare mode register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC1S        : 2;
  unsigned char             : 1;
  unsigned char OC1PE       : 1;
  unsigned char OC1M        : 3;
} __BITS_TIM5_CCMR1;
#endif
__IO_REG8_BIT(TIM5_CCMR1,  0x5307, __READ_WRITE, __BITS_TIM5_CCMR1);

/* TIM5 capture/compare mode register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC2S        : 2;
  unsigned char             : 1;
  unsigned char OC2PE       : 1;
  unsigned char OC2M        : 3;
} __BITS_TIM5_CCMR2;
#endif
__IO_REG8_BIT(TIM5_CCMR2,  0x5308, __READ_WRITE, __BITS_TIM5_CCMR2);

/* TIM5 capture/compare mode register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC3S        : 2;
  unsigned char             : 1;
  unsigned char OC3PE       : 1;
  unsigned char OC3M        : 3;
} __BITS_TIM5_CCMR3;
#endif
__IO_REG8_BIT(TIM5_CCMR3,  0x5309, __READ_WRITE, __BITS_TIM5_CCMR3);

/* TIM5 capture/compare enable register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC1E        : 1;
  unsigned char CC1P        : 1;
  unsigned char             : 2;
  unsigned char CC2E        : 1;
  unsigned char CC2P        : 1;
} __BITS_TIM5_CCER1;
#endif
__IO_REG8_BIT(TIM5_CCER1,  0x530A, __READ_WRITE, __BITS_TIM5_CCER1);

/* TIM5 capture/compare enable register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC3E        : 1;
  unsigned char CC3P        : 1;
} __BITS_TIM5_CCER2;
#endif
__IO_REG8_BIT(TIM5_CCER2,  0x530B, __READ_WRITE, __BITS_TIM5_CCER2);

/* TIM5 counter high */
__IO_REG8    (TIM5_CNTRH,  0x530C, __READ_WRITE);
/* TIM5 counter low */
__IO_REG8    (TIM5_CNTRL,  0x530D, __READ_WRITE);
/* TIM5 prescaler register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PSC         : 4;
} __BITS_TIM5_PSCR;
#endif
__IO_REG8_BIT(TIM5_PSCR,   0x530E, __READ_WRITE, __BITS_TIM5_PSCR);

/* TIM5 auto-reload register high */
__IO_REG8    (TIM5_ARRH,   0x530F, __READ_WRITE);
/* TIM5 auto-reload register low */
__IO_REG8    (TIM5_ARRL,   0x5310, __READ_WRITE);
/* TIM5 capture/compare register 1 high */
__IO_REG8    (TIM5_CCR1H,  0x5311, __READ_WRITE);
/* TIM5 capture/compare register 1 low */
__IO_REG8    (TIM5_CCR1L,  0x5312, __READ_WRITE);
/* TIM5 capture/compare reg */
__IO_REG8    (TIM5_CCR2H,  0x5313, __READ_WRITE);
/* TIM5 capture/compare register 2 low */
__IO_REG8    (TIM5_CCR2L,  0x5314, __READ_WRITE);
/* TIM5 capture/compare register 3 high */
__IO_REG8    (TIM5_CCR3H,  0x5315, __READ_WRITE);
/* TIM5 capture/compare register 3 low */
__IO_REG8    (TIM5_CCR3L,  0x5316, __READ_WRITE);

/*-------------------------------------------------------------------------
 *      TIM5 bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define TIM5_CR1_CEN             TIM5_CR1_bit.CEN
#define TIM5_CR1_UDIS            TIM5_CR1_bit.UDIS
#define TIM5_CR1_URS             TIM5_CR1_bit.URS
#define TIM5_CR1_OPM             TIM5_CR1_bit.OPM
#define TIM5_CR1_ARPE            TIM5_CR1_bit.ARPE

#define TIM5_CR2_CCPC            TIM5_CR2_bit.CCPC
#define TIM5_CR2_COMS            TIM5_CR2_bit.COMS
#define TIM5_CR2_MMS             TIM5_CR2_bit.MMS

#define TIM5_SMCR_SMS            TIM5_SMCR_bit.SMS
#define TIM5_SMCR_TS             TIM5_SMCR_bit.TS
#define TIM5_SMCR_MSM            TIM5_SMCR_bit.MSM

#define TIM5_IER_UIE             TIM5_IER_bit.UIE
#define TIM5_IER_CC1IE           TIM5_IER_bit.CC1IE
#define TIM5_IER_CC2IE           TIM5_IER_bit.CC2IE
#define TIM5_IER_CC3IE           TIM5_IER_bit.CC3IE
#define TIM5_IER_TIE             TIM5_IER_bit.TIE

#define TIM5_SR1_UIF             TIM5_SR1_bit.UIF
#define TIM5_SR1_CC1IF           TIM5_SR1_bit.CC1IF
#define TIM5_SR1_CC2IF           TIM5_SR1_bit.CC2IF
#define TIM5_SR1_CC3IF           TIM5_SR1_bit.CC3IF
#define TIM5_SR1_TIF             TIM5_SR1_bit.TIF

